In [1]:
import pandas as pd


data_list = [10, 20, 30, 40, 50]


data_series = pd.Series(data_list)


print("Original List:")
print(data_list)
print("\nConverted Series:")
print(data_series)

Original List:
[10, 20, 30, 40, 50]

Converted Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
l = pd.date_range("2021-5-1","2021-5-12")
print(pd.Series(l))

0    2021-05-01
1    2021-05-02
2    2021-05-03
3    2021-05-04
4    2021-05-05
5    2021-05-06
6    2021-05-07
7    2021-05-08
8    2021-05-09
9    2021-05-10
10   2021-05-11
11   2021-05-12
dtype: datetime64[ns]

In [5]:



data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}


df = pd.DataFrame(data)


print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [12]:
import pandas as pd


data = [
    ["Alice", 25, "New York"],
    ["Bob", 30, "Los Angeles"],
    ["Charlie", 35, "Chicago"],
    ["David", 40, "Houston"]
]


df = pd.DataFrame(data, columns=["Name", "Age", "City"])

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [13]:

csv_file = 'test.csv'

df = pd.read_csv(csv_file)
print(df)

      Name  Age   Department  Salary
0    Alice   28           HR   55000
1      Bob   32  Engineering   75000
2  Charlie   40    Marketing   60000
3    David   25      Finance   60000
4      Eve   35  Engineering   80000
5    Frank   45           HR   58000
6    Grace   29    Marketing   62000
7   Hannah   33  Engineering   72000
8      Ivy   28      Finance   61000
9     Jack   30    Marketing   63000

In [14]:

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 30, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Los Angeles', 'New York']
}

df = pd.DataFrame(data)
df_sorted = df.sort_values(by=['City'])
print(df_sorted)

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   30  Los Angeles
3    David   30  Los Angeles
0    Alice   25     New York
4      Eve   28     New York

In [15]:



data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 30, 28]
}

custom_index = ['A', 'B', 'C', 'D', 'E']

df = pd.DataFrame(data, index=custom_index)

df_reset = df.reset_index(drop=True)

print(df_reset)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   30
4      Eve   28

In [16]:


data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 30, 28]
}

df = pd.DataFrame(data)

first_two_rows = df.head(2)

print(first_two_rows)

    Name  Age
0  Alice   25
1    Bob   30

In [17]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Occupation': ['Engineer', 'Teacher', 'Doctor', 'Engineer', 'Doctor'],
    'Salary': [60000, 45000, 75000, 65000, 80000]
}

df = pd.DataFrame(data)

average_salary_per_occupation = df.groupby('Occupation')['Salary'].mean()

print(average_salary_per_occupation)

Occupation
Doctor      77500.0
Engineer    62500.0
Teacher     45000.0
Name: Salary, dtype: float64

In [18]:
import pandas as pd
import numpy as np


data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, 2, 3, 4, np.nan]
}

df = pd.DataFrame(data)

df_filled = df.fillna(0)


print(df_filled)

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  2.0
2  0.0  3.0  3.0
3  4.0  0.0  4.0
4  5.0  5.0  0.0

In [19]:
import pandas as pd

data = {
    'cname': ['Company A', 'Company B', 'Company C', 'Company D'],
    'profit': [10000, -5000, 0, 7500]
}

df = pd.DataFrame(data)

df['profit'] = df['profit'].apply(lambda x: x > 0)

print(df)

       cname  profit
0  Company A    True
1  Company B   False
2  Company C   False
3  Company D    True

In [20]:
import pandas as pd

data1 = {
    'eid': [101, 102, 103, 104],
    'ename': ['Alice', 'Bob', 'Charlie', 'David'],
    'stipend': [5000, 6000, 5500, 7000]
}

data2 = {
    'eid': [101, 103, 104, 105],
    'designation': ['Engineer', 'Manager', 'Analyst', 'Technician']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

result_df = df1.merge(df2, on='eid', how='left')

result_df = result_df.rename(columns={'designation': 'position'})

print(result_df)

   eid    ename  stipend  position
0  101    Alice     5000  Engineer
1  102      Bob     6000       NaN
2  103  Charlie     5500   Manager
3  104    David     7000   Analyst